Revit 2026 API

# ValueAtPointBase Methods

---

The ValueAtPointBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ClearAllFlags | Sets flags for all measurements to ValueAtPointFlags::None. |
|  | ClearFlagsAt | Sets flags for the given measurement to ValueAtPointFlags::None. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFlags | Returns flags for the given measurement. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetFlags(IListInt32) |  |
|  | SetFlags(Int32) | Sets the flags associated to all measurements to the same value. |
|  | SetFlags(Int32, Int32) | Sets the flags associated to a given measurement. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ValueAtPointBase Class

Autodesk.Revit.DB Namespace